
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ВыполнитьМетод(Команда)
	
	// Валидация данных
	Если Не ЗначениеЗаполнено(ТекстЗапросMCP) Тогда
		ПоказатьПредупреждение(,"Заполните текст запроса и повторите попытку",,"Предупреждение");
		Возврат;
	КонецЕсли;
	
	// Отправка запроса
	СтруктураОтвета = ЗапросКLLM();
	Если Не СтруктураОтвета.Ответ Тогда 
		ПоказатьПредупреждение(,"Ошибка: " 
			+ СтруктураОтвета.Результат.error_type + Символы.ПС
			+ СтруктураОтвета.Результат.details.ollama_error + Символы.ПС 
			+ Символы.ПС + СтруктураОтвета.Текст + Символы.ПС
			+ СтруктураОтвета.Результат.suggestion,,"Предупреждение");
		Возврат;
	КонецЕсли;
	
	// Вывод ответа
	ТекстОтветMCP = ""; 
	ТекстОтветMCP = ТекстОтветMCP + СтруктураОтвета.Текст 
		+ Символы.ПС + СтруктураОтвета.Результат.content;
	
КонецПроцедуры 

#КонецОбласти   
   
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеВРеквизитФормы(mcp_КонтейнерыПовтИсп.Инструменты(), "ТаблицаИнструментов");
	
КонецПроцедуры

&НаСервере
Функция ЗапросКLLM() Экспорт
	
	СтруктураОтвета = Новый Структура;
	
	// Формируем тело запроса (JSON)
	ТелоСтруктура = Новый Структура;
	ТелоСтруктура.Вставить("text", ТекстЗапросMCP);  
	
	// Заголовки
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	// Создаем HTTP-запрос 
	HTTPЗапрос = Новый HTTPЗапрос("/", Заголовки);
    HTTPЗапрос.УстановитьТелоИзСтроки(mcp_ОбщегоНазначения.СтруктураВJSON(ТелоСтруктура), КодировкаТекста.UTF8);
	
	// Запуск LLM (Ollama)
	ЗапускOllamaLLM();
	
	// Запуск LLM-Orchestrator
	Если РежимИсполнения Тогда
		ЗапускOrchestratorServer();
	Иначе 	
		ЗапускOrchestratorLocal(); 
	КонецЕсли;
	
	// ⚠️ здесь просто "ожидание" 30 секунд
	ОбщегоНазначенияБТС.Пауза(30);
	
	// Соединение (локальный orchestrator)
	Соединение = Новый HTTPСоединение("localhost", 9000);
	Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	// Парсинг JSON в структуру
	Данные = mcp_ОбщегоНазначения.JSONВСтруктуру(Ответ.ПолучитьТелоКакСтроку());

	// Проверка кода ответа
	Если Ответ.КодСостояния <> 200 Тогда
		СтруктураОтвета.Вставить("Ответ", Ложь);
		СтруктураОтвета.Вставить(
			"ОписаниеОшибки",
			"Ошибка LLM. Код HTTP: " + Ответ.КодСостояния + Символы.ПС + Ответ.ПолучитьТелоКакСтроку()
		);
		Возврат СтруктураОтвета;
	КонецЕсли;
		
	// Ожидаем поле result
	Если НЕ Данные.Свойство("Result") Тогда
		СтруктураОтвета.Вставить("Ответ", Ложь);
		СтруктураОтвета.Вставить(
			"ОписаниеОшибки",
			"Некорректный ответ от LLM"
		);
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	// Успех
	СтруктураОтвета.Вставить("Ответ", Данные.Success);
	СтруктураОтвета.Вставить("Текст", Данные.Text);
	СтруктураОтвета.Вставить("Результат", Данные.Result);
	
	Возврат СтруктураОтвета;
	
КонецФункции  

&НаСервере
Функция ЗапускOrchestratorServer() 
	
КонецФункции

&НаСервере
Функция ЗапускOrchestratorLocal() 
	
	// Создание каталога Orchestrator 
	ИмяКаталога = "C:\llm_orchestrator";
	СоздатьКаталог(ИмяКаталога);                          
	
	// Выгрузка LLM-Orchestrator в каталог    
	Обработка = РеквизитФормыВЗначение("Объект");
	ДанныеOrchestrator = Обработка.ПолучитьМакет("LLM_Orchestrator"); 
	ПутьКФайлу = ИмяКаталога + "\" + "LLM_Orchestrator.py";
	ДанныеOrchestrator.Записать(ПутьКФайлу); 
	
	// Установи зависимости (pip install requests) 
	ЗапуститьПриложение(СтрШаблон("cmd.exe /c cd /d %1 && pip install requests", ИмяКаталога));

	
	// Запуск LLM-Orchestrator (python  LLM_Orchestrator.py) 
	ЗапуститьПриложение("cmd.exe /k C:\llm_orchestrator\LLM_Orchestrator.py");
	
КонецФункции  

&НаСервере
Функция ЗапускOllamaLLM() 
	
	// Проверка запуска Ollama 
	// ...
	
	// Проверка наличия LLM (ollama list)
	// ...
	
	// Запуск Ollama (ollama serve)  
	ЗапуститьПриложение("cmd.exe /c """"C:\Users\%USERNAME%\AppData\Local\Programs\Ollama\ollama.exe"" serve""");

КонецФункции

#КонецОбласти